zbigniewmotyka/comfoair-esp32/components/comfoair/comfoair.h
#pragma once
#include <esp32_can.h>
#include "esphome.h"

#include "esphome/core/component.h"
#include "esphome/components/sensor/sensor.h"
#include "esphome/components/binary_sensor/binary_sensor.h"
#include "esphome/components/text_sensor/text_sensor.h"

namespace esphome {
namespace comfoair {

template <typename T, typename CONV>
class ComfoSensor {
  public:
    T* sensor;
    float divider;
    CONV conversion;
    string device_class;
    string state_class;
};

class Comfoair: public Component, public esphome::api::CustomAPIDevice {
 public:
  void set_rx(int rx) { rx_ = rx; }
  void set_tx(int tx) { tx_ = tx; }
  void register_sensor(sensor::Sensor *obj, int PDOID, int conversionType, int divider, string device_class, string state_class) {
    ComfoSensor<sensor::Sensor, int> *cs = new ComfoSensor<sensor::Sensor, int>();
    cs->sensor = obj;
    cs->divider = divider;
    cs->conversion = conversionType;
    cs->device_class = deviceClass;
    cs->state_class = stateClass;
    sensors[PDOID] = *cs;
  }
  void register_textSensor(text_sensor::TextSensor *obj, int PDOID, std::string (*convLambda)(uint8_t *) ) {
    ComfoSensor<text_sensor::TextSensor, std::string (*)(uint8_t *)> *cs = new ComfoSensor<text_sensor::TextSensor, std::string (*)(uint8_t *)>();
    cs->sensor = obj;
    cs->conversion = convLambda;
    textSensors[PDOID] = *cs;
  }
  void send_command(std::string command) ;
  void sendHex(std::string hex);
  void sendVector(std::vector<uint8_t> *data);
  void sendRaw(uint8_t length, uint8_t *buf);
  void setup() override;
  void loop() override;
  void dump_config() override;

 private:
  CAN_FRAME canMessage;

 protected:
  int rx_{-1};
  int tx_{-1};
  uint8_t sequence = 0;
  std::map<int, ComfoSensor<sensor::Sensor, int>> sensors;
  std::map<int, ComfoSensor<text_sensor::TextSensor,  std::string (*)(uint8_t *)>> textSensors;
};

} //namespace comfoair
} //namespace esphome
